<details>
<summary>Execution result of "run --all plan" in "."</summary>

```terraform
00:19:38.753 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module ./management-account/eu-west-1/s3
- Module ./management-account/global-infra/organization-accounts
- Module ./playground-account/eu-west-1/s3
- Module ./test-account/eu-west-1/s3


00:19:38.884 INFO   [management-account/global-infra/organization-accounts] Downloading Terraform configurations from ./modules/organization-account into ./management-account/global-infra/organization-accounts/.terragrunt-cache/3XLPvzLN2Hf8668drqHKYhDUbDk/Yycl6dC0BtLQ-XFNjTw2ySiFaUQ
00:19:38.898 INFO   [management-account/eu-west-1/s3] Downloading Terraform configurations from ./modules/s3 into ./management-account/eu-west-1/s3/.terragrunt-cache/6O7bSTWfYv7WPnJvTEak2cevHGQ/p0hmT_yU9GfVIbcsvydhmNhIJWg
00:19:38.917 INFO   [test-account/eu-west-1/s3] Downloading Terraform configurations from ./modules/s3 into ./test-account/eu-west-1/s3/.terragrunt-cache/FIgbXJVdUJAkmsa6YIf24Zbjalw/p0hmT_yU9GfVIbcsvydhmNhIJWg
00:19:38.926 INFO   [playground-account/eu-west-1/s3] Downloading Terraform configurations from ./modules/s3 into ./playground-account/eu-west-1/s3/.terragrunt-cache/Ife-siSQSkZudNuf1ioRzK__ydI/p0hmT_yU9GfVIbcsvydhmNhIJWg
00:19:39.396 INFO   [management-account/eu-west-1/s3] terraform: Initializing the backend...
00:19:39.399 INFO   [management-account/global-infra/organization-accounts] terraform: Initializing the backend...
00:19:39.403 INFO   [playground-account/eu-west-1/s3] terraform: Initializing the backend...
00:19:39.412 INFO   [test-account/eu-west-1/s3] terraform: Initializing the backend...
00:19:40.296 INFO   [playground-account/eu-west-1/s3] terraform: 
00:19:40.296 INFO   [playground-account/eu-west-1/s3] terraform: Successfully configured the backend "s3"! Terraform will automatically
00:19:40.296 INFO   [playground-account/eu-west-1/s3] terraform: use this backend unless the backend configuration changes.
00:19:40.309 INFO   [management-account/eu-west-1/s3] terraform: 
00:19:40.309 INFO   [management-account/eu-west-1/s3] terraform: Successfully configured the backend "s3"! Terraform will automatically
00:19:40.309 INFO   [test-account/eu-west-1/s3] terraform: 
00:19:40.309 INFO   [management-account/eu-west-1/s3] terraform: use this backend unless the backend configuration changes.
00:19:40.309 INFO   [test-account/eu-west-1/s3] terraform: Successfully configured the backend "s3"! Terraform will automatically
00:19:40.310 INFO   [test-account/eu-west-1/s3] terraform: use this backend unless the backend configuration changes.
00:19:40.319 INFO   [management-account/global-infra/organization-accounts] terraform: 
00:19:40.319 INFO   [management-account/global-infra/organization-accounts] terraform: Successfully configured the backend "s3"! Terraform will automatically
00:19:40.319 INFO   [management-account/global-infra/organization-accounts] terraform: use this backend unless the backend configuration changes.
00:19:40.662 INFO   [playground-account/eu-west-1/s3] terraform: Initializing provider plugins...
00:19:40.662 INFO   [playground-account/eu-west-1/s3] terraform: - Finding latest version of hashicorp/aws...
00:19:40.662 INFO   [management-account/eu-west-1/s3] terraform: Initializing provider plugins...
00:19:40.663 INFO   [management-account/eu-west-1/s3] terraform: - Finding latest version of hashicorp/aws...
00:19:40.667 INFO   [test-account/eu-west-1/s3] terraform: Initializing provider plugins...
00:19:40.667 INFO   [test-account/eu-west-1/s3] terraform: - Finding latest version of hashicorp/aws...
00:19:40.679 INFO   [management-account/global-infra/organization-accounts] terraform: Initializing provider plugins...
00:19:40.679 INFO   [management-account/global-infra/organization-accounts] terraform: - Finding latest version of hashicorp/aws...
00:19:40.833 INFO   [management-account/eu-west-1/s3] terraform: - Installing hashicorp/aws v6.2.0...
00:19:40.862 INFO   [management-account/global-infra/organization-accounts] terraform: - Installing hashicorp/aws v6.2.0...
00:19:40.897 INFO   [playground-account/eu-west-1/s3] terraform: - Installing hashicorp/aws v6.2.0...
00:19:40.925 INFO   [test-account/eu-west-1/s3] terraform: - Installing hashicorp/aws v6.2.0...
00:19:47.009 INFO   [management-account/eu-west-1/s3] terraform: - Installed hashicorp/aws v6.2.0 (signed by HashiCorp)
00:19:47.009 INFO   [management-account/eu-west-1/s3] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
00:19:47.010 INFO   [management-account/eu-west-1/s3] terraform: selections it made above. Include this file in your version control repository
00:19:47.010 INFO   [management-account/eu-west-1/s3] terraform: so that Terraform can guarantee to make the same selections by default when
00:19:47.010 INFO   [management-account/eu-west-1/s3] terraform: you run "terraform init" in the future.
00:19:47.010 INFO   [management-account/eu-west-1/s3] terraform: Terraform has been successfully initialized!
00:19:47.027 INFO   [management-account/global-infra/organization-accounts] terraform: - Installed hashicorp/aws v6.2.0 (signed by HashiCorp)
00:19:47.027 INFO   [management-account/global-infra/organization-accounts] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
00:19:47.027 INFO   [management-account/global-infra/organization-accounts] terraform: selections it made above. Include this file in your version control repository
00:19:47.027 INFO   [management-account/global-infra/organization-accounts] terraform: so that Terraform can guarantee to make the same selections by default when
00:19:47.028 INFO   [management-account/global-infra/organization-accounts] terraform: you run "terraform init" in the future.
00:19:47.028 INFO   [management-account/global-infra/organization-accounts] terraform: Terraform has been successfully initialized!
00:19:47.467 INFO   [test-account/eu-west-1/s3] terraform: - Installed hashicorp/aws v6.2.0 (signed by HashiCorp)
00:19:47.467 INFO   [test-account/eu-west-1/s3] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
00:19:47.467 INFO   [test-account/eu-west-1/s3] terraform: selections it made above. Include this file in your version control repository
00:19:47.467 INFO   [test-account/eu-west-1/s3] terraform: so that Terraform can guarantee to make the same selections by default when
00:19:47.467 INFO   [test-account/eu-west-1/s3] terraform: you run "terraform init" in the future.
00:19:47.467 INFO   [test-account/eu-west-1/s3] terraform: Terraform has been successfully initialized!
00:19:47.574 INFO   [playground-account/eu-west-1/s3] terraform: - Installed hashicorp/aws v6.2.0 (signed by HashiCorp)
00:19:47.574 INFO   [playground-account/eu-west-1/s3] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
00:19:47.574 INFO   [playground-account/eu-west-1/s3] terraform: selections it made above. Include this file in your version control repository
00:19:47.574 INFO   [playground-account/eu-west-1/s3] terraform: so that Terraform can guarantee to make the same selections by default when
00:19:47.574 INFO   [playground-account/eu-west-1/s3] terraform: you run "terraform init" in the future.
00:19:47.574 INFO   [playground-account/eu-west-1/s3] terraform: Terraform has been successfully initialized!
00:19:52.642 STDOUT [management-account/eu-west-1/s3] terraform: aws_s3_bucket.this["ma-test-bucket-terragrunt-main-account"]: Refreshing state... [id=ma-test-bucket-terragrunt-main-account]
00:19:52.708 STDOUT [management-account/global-infra/organization-accounts] terraform: aws_organizations_account.this: Refreshing state... [id=929864627295]
00:19:53.295 STDOUT [management-account/global-infra/organization-accounts] terraform: No changes. Your infrastructure matches the configuration.
00:19:53.296 STDOUT [management-account/global-infra/organization-accounts] terraform: Terraform has compared your real infrastructure against your configuration
00:19:53.296 STDOUT [management-account/global-infra/organization-accounts] terraform: and found no differences, so no changes are needed.
00:19:53.613 STDOUT [test-account/eu-west-1/s3] terraform: aws_s3_bucket.this: Refreshing state... [id=ma-test-bucket-terragrunt-test-account]
00:19:53.669 STDOUT [playground-account/eu-west-1/s3] terraform: aws_s3_bucket.this: Refreshing state... [id=ma-test-bucket-terragrunt]
00:19:54.492 STDOUT [management-account/eu-west-1/s3] terraform: No changes. Your infrastructure matches the configuration.
00:19:54.492 STDOUT [management-account/eu-west-1/s3] terraform: Terraform has compared your real infrastructure against your configuration
00:19:54.492 STDOUT [management-account/eu-west-1/s3] terraform: and found no differences, so no changes are needed.
00:19:55.526 STDOUT [test-account/eu-west-1/s3] terraform: Terraform used the selected providers to generate the following execution
00:19:55.526 STDOUT [test-account/eu-west-1/s3] terraform: plan. Resource actions are indicated with the following symbols:
00:19:55.526 STDOUT [test-account/eu-west-1/s3] terraform:   + create
00:19:55.526 STDOUT [test-account/eu-west-1/s3] terraform:   - destroy
00:19:55.526 STDOUT [test-account/eu-west-1/s3] terraform: Terraform will perform the following actions:
00:19:55.526 STDOUT [test-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this will be destroyed
00:19:55.526 STDOUT [test-account/eu-west-1/s3] terraform:   # (because resource uses count or for_each)
00:19:55.526 STDOUT [test-account/eu-west-1/s3] terraform:   - resource "aws_s3_bucket" "this" {
00:19:55.526 STDOUT [test-account/eu-west-1/s3] terraform:       - arn                         = "arn:aws:s3:::ma-test-bucket-terragrunt-test-account" -> null
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:       - bucket                      = "ma-test-bucket-terragrunt-test-account" -> null
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:       - bucket_domain_name          = "ma-test-bucket-terragrunt-test-account.s3.amazonaws.com" -> null
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:       - bucket_region               = "eu-west-1" -> null
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:       - bucket_regional_domain_name = "ma-test-bucket-terragrunt-test-account.s3.eu-west-1.amazonaws.com" -> null
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:       - force_destroy               = false -> null
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:       - hosted_zone_id              = "Z1BKCTXD74EZPE" -> null
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:       - id                          = "ma-test-bucket-terragrunt-test-account" -> null
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:       - object_lock_enabled         = false -> null
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:       - region                      = "eu-west-1" -> null
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:       - request_payer               = "BucketOwner" -> null
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:       - tags                        = {
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:           - "Environment" = "test-env"
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:           - "Name"        = "ma-test-bucket-tag-test-account"
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:         } -> null
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:       - tags_all                    = {
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:           - "Environment" = "test-env"
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:           - "Name"        = "ma-test-bucket-tag-test-account"
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:         } -> null
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:         # (3 unchanged attributes hidden)
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:       - grant {
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:           - id          = "52a4785162cb6f9cec841c46fb038426825896161cb6a9172f58b765693d29a4" -> null
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:           - permissions = [
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:               - "FULL_CONTROL",
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:             ] -> null
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:           - type        = "CanonicalUser" -> null
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:             # (1 unchanged attribute hidden)
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:         }
00:19:55.527 STDOUT [test-account/eu-west-1/s3] terraform:       - server_side_encryption_configuration {
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:           - rule {
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:               - bucket_key_enabled = false -> null
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:               - apply_server_side_encryption_by_default {
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:                   - sse_algorithm     = "AES256" -> null
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:                     # (1 unchanged attribute hidden)
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:                 }
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:             }
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:         }
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:       - versioning {
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:           - enabled    = false -> null
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:           - mfa_delete = false -> null
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:         }
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:     }
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this["ma-test-bucket-terragrunt-test-account"] will be created
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:   + resource "aws_s3_bucket" "this" {
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:       + acceleration_status         = (known after apply)
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:       + acl                         = (known after apply)
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:       + arn                         = (known after apply)
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:       + bucket                      = "ma-test-bucket-terragrunt-test-account"
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:       + bucket_domain_name          = (known after apply)
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:       + bucket_prefix               = (known after apply)
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:       + bucket_region               = (known after apply)
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:       + bucket_regional_domain_name = (known after apply)
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:       + force_destroy               = false
00:19:55.528 STDOUT [test-account/eu-west-1/s3] terraform:       + hosted_zone_id              = (known after apply)
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:       + id                          = (known after apply)
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:       + object_lock_enabled         = (known after apply)
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:       + policy                      = (known after apply)
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:       + region                      = "eu-west-1"
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:       + request_payer               = (known after apply)
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:       + tags                        = {
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag-test-account"
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:         }
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:       + tags_all                    = {
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag-test-account"
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:         }
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:       + website_domain              = (known after apply)
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:       + website_endpoint            = (known after apply)
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:       + cors_rule (known after apply)
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:       + grant (known after apply)
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:       + lifecycle_rule (known after apply)
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:       + logging (known after apply)
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:       + object_lock_configuration (known after apply)
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:       + replication_configuration (known after apply)
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:       + server_side_encryption_configuration (known after apply)
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:       + versioning (known after apply)
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:       + website (known after apply)
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:     }
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform: Plan: 1 to add, 0 to change, 1 to destroy.
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform: 
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform: Changes to Outputs:
00:19:55.529 STDOUT [test-account/eu-west-1/s3] terraform:   ~ bucket_id = "ma-test-bucket-terragrunt-test-account" -> {
00:19:55.530 STDOUT [test-account/eu-west-1/s3] terraform:       + ma-test-bucket-terragrunt-test-account = (known after apply)
00:19:55.530 STDOUT [test-account/eu-west-1/s3] terraform:     }
00:19:55.576 STDOUT [playground-account/eu-west-1/s3] terraform: Terraform used the selected providers to generate the following execution
00:19:55.576 STDOUT [playground-account/eu-west-1/s3] terraform: plan. Resource actions are indicated with the following symbols:
00:19:55.576 STDOUT [playground-account/eu-west-1/s3] terraform:   + create
00:19:55.576 STDOUT [playground-account/eu-west-1/s3] terraform:   - destroy
00:19:55.576 STDOUT [playground-account/eu-west-1/s3] terraform: Terraform will perform the following actions:
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this will be destroyed
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:   # (because resource uses count or for_each)
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:   - resource "aws_s3_bucket" "this" {
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:       - arn                         = "arn:aws:s3:::ma-test-bucket-terragrunt" -> null
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:       - bucket                      = "ma-test-bucket-terragrunt" -> null
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:       - bucket_domain_name          = "ma-test-bucket-terragrunt.s3.amazonaws.com" -> null
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:       - bucket_region               = "eu-west-1" -> null
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:       - bucket_regional_domain_name = "ma-test-bucket-terragrunt.s3.eu-west-1.amazonaws.com" -> null
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:       - force_destroy               = false -> null
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:       - hosted_zone_id              = "Z1BKCTXD74EZPE" -> null
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:       - id                          = "ma-test-bucket-terragrunt" -> null
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:       - object_lock_enabled         = false -> null
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:       - region                      = "eu-west-1" -> null
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:       - request_payer               = "BucketOwner" -> null
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:       - tags                        = {
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:           - "Environment" = "test-env"
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:           - "Name"        = "ma-test-bucket-tag"
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:         } -> null
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:       - tags_all                    = {
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:           - "Environment" = "test-env"
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:           - "Name"        = "ma-test-bucket-tag"
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:         } -> null
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:         # (3 unchanged attributes hidden)
00:19:55.577 STDOUT [playground-account/eu-west-1/s3] terraform:       - grant {
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:           - id          = "930454f06437e7fdb90b65c7ecea90969c129dcffb5f63020b02e1295aa3c04d" -> null
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:           - permissions = [
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:               - "FULL_CONTROL",
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:             ] -> null
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:           - type        = "CanonicalUser" -> null
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:             # (1 unchanged attribute hidden)
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:         }
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:       - server_side_encryption_configuration {
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:           - rule {
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:               - bucket_key_enabled = false -> null
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:               - apply_server_side_encryption_by_default {
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:                   - sse_algorithm     = "AES256" -> null
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:                     # (1 unchanged attribute hidden)
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:                 }
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:             }
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:         }
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:       - versioning {
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:           - enabled    = false -> null
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:           - mfa_delete = false -> null
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:         }
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:     }
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this["ma-bucket-one-altamash"] will be created
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:   + resource "aws_s3_bucket" "this" {
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:       + acceleration_status         = (known after apply)
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:       + acl                         = (known after apply)
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:       + arn                         = (known after apply)
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket                      = "ma-bucket-one-altamash"
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_domain_name          = (known after apply)
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_prefix               = (known after apply)
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_region               = (known after apply)
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_regional_domain_name = (known after apply)
00:19:55.578 STDOUT [playground-account/eu-west-1/s3] terraform:       + force_destroy               = false
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:       + hosted_zone_id              = (known after apply)
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:       + id                          = (known after apply)
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:       + object_lock_enabled         = (known after apply)
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:       + policy                      = (known after apply)
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:       + region                      = "eu-west-1"
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:       + request_payer               = (known after apply)
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:       + tags                        = {
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag"
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:         }
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:       + tags_all                    = {
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag"
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:         }
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:       + website_domain              = (known after apply)
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:       + website_endpoint            = (known after apply)
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:       + cors_rule (known after apply)
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:       + grant (known after apply)
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:       + lifecycle_rule (known after apply)
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:       + logging (known after apply)
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:       + object_lock_configuration (known after apply)
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:       + replication_configuration (known after apply)
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:       + server_side_encryption_configuration (known after apply)
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:       + versioning (known after apply)
00:19:55.579 STDOUT [playground-account/eu-west-1/s3] terraform:       + website (known after apply)
00:19:55.580 STDOUT [playground-account/eu-west-1/s3] terraform:     }
00:19:55.580 STDOUT [playground-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this["ma-bucket-two-altamash"] will be created
00:19:55.580 STDOUT [playground-account/eu-west-1/s3] terraform:   + resource "aws_s3_bucket" "this" {
00:19:55.580 STDOUT [playground-account/eu-west-1/s3] terraform:       + acceleration_status         = (known after apply)
00:19:55.580 STDOUT [playground-account/eu-west-1/s3] terraform:       + acl                         = (known after apply)
00:19:55.580 STDOUT [playground-account/eu-west-1/s3] terraform:       + arn                         = (known after apply)
00:19:55.580 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket                      = "ma-bucket-two-altamash"
00:19:55.580 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_domain_name          = (known after apply)
00:19:55.580 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_prefix               = (known after apply)
00:19:55.580 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_region               = (known after apply)
00:19:55.580 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_regional_domain_name = (known after apply)
00:19:55.580 STDOUT [playground-account/eu-west-1/s3] terraform:       + force_destroy               = false
00:19:55.580 STDOUT [playground-account/eu-west-1/s3] terraform:       + hosted_zone_id              = (known after apply)
00:19:55.580 STDOUT [playground-account/eu-west-1/s3] terraform:       + id                          = (known after apply)
00:19:55.580 STDOUT [playground-account/eu-west-1/s3] terraform:       + object_lock_enabled         = (known after apply)
00:19:55.580 STDOUT [playground-account/eu-west-1/s3] terraform:       + policy                      = (known after apply)
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:       + region                      = "eu-west-1"
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:       + request_payer               = (known after apply)
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:       + tags                        = {
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag"
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:         }
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:       + tags_all                    = {
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag"
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:         }
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:       + website_domain              = (known after apply)
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:       + website_endpoint            = (known after apply)
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:       + cors_rule (known after apply)
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:       + grant (known after apply)
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:       + lifecycle_rule (known after apply)
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:       + logging (known after apply)
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:       + object_lock_configuration (known after apply)
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:       + replication_configuration (known after apply)
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:       + server_side_encryption_configuration (known after apply)
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:       + versioning (known after apply)
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:       + website (known after apply)
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:     }
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform: Plan: 2 to add, 0 to change, 1 to destroy.
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform: 
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform: Changes to Outputs:
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:   ~ bucket_id = "ma-test-bucket-terragrunt" -> {
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:       + ma-bucket-one-altamash = (known after apply)
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:       + ma-bucket-two-altamash = (known after apply)
00:19:55.581 STDOUT [playground-account/eu-west-1/s3] terraform:     }
```

</details>
    
